zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_EMAC.h
#define EMAC_MAC_FPE_CTRL_STS_S1_SET_0_MASK      (0x8U)
#define EMAC_MAC_FPE_CTRL_STS_S1_SET_0_SHIFT     (3U)
#define EMAC_MAC_FPE_CTRL_STS_S1_SET_0_WIDTH     (1U)
#define EMAC_MAC_FPE_CTRL_STS_S1_SET_0(x)        (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_S1_SET_0_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_S1_SET_0_MASK)

#define EMAC_MAC_FPE_CTRL_STS_RVER_MASK          (0x10000U)
#define EMAC_MAC_FPE_CTRL_STS_RVER_SHIFT         (16U)
#define EMAC_MAC_FPE_CTRL_STS_RVER_WIDTH         (1U)
#define EMAC_MAC_FPE_CTRL_STS_RVER(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_RVER_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_RVER_MASK)

#define EMAC_MAC_FPE_CTRL_STS_RRSP_MASK          (0x20000U)
#define EMAC_MAC_FPE_CTRL_STS_RRSP_SHIFT         (17U)
#define EMAC_MAC_FPE_CTRL_STS_RRSP_WIDTH         (1U)
#define EMAC_MAC_FPE_CTRL_STS_RRSP(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_RRSP_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_RRSP_MASK)

#define EMAC_MAC_FPE_CTRL_STS_TVER_MASK          (0x40000U)
#define EMAC_MAC_FPE_CTRL_STS_TVER_SHIFT         (18U)
#define EMAC_MAC_FPE_CTRL_STS_TVER_WIDTH         (1U)
#define EMAC_MAC_FPE_CTRL_STS_TVER(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_TVER_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_TVER_MASK)

#define EMAC_MAC_FPE_CTRL_STS_TRSP_MASK          (0x80000U)
#define EMAC_MAC_FPE_CTRL_STS_TRSP_SHIFT         (19U)
#define EMAC_MAC_FPE_CTRL_STS_TRSP_WIDTH         (1U)
#define EMAC_MAC_FPE_CTRL_STS_TRSP(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_FPE_CTRL_STS_TRSP_SHIFT)) & EMAC_MAC_FPE_CTRL_STS_TRSP_MASK)
/*! @} */

/*! @name MAC_PRESN_TIME_NS - MAC Presentation Time */
/*! @{ */

#define EMAC_MAC_PRESN_TIME_NS_MPTN_MASK         (0xFFFFFFFFU)
#define EMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT        (0U)
#define EMAC_MAC_PRESN_TIME_NS_MPTN_WIDTH        (32U)
#define EMAC_MAC_PRESN_TIME_NS_MPTN(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PRESN_TIME_NS_MPTN_SHIFT)) & EMAC_MAC_PRESN_TIME_NS_MPTN_MASK)
/*! @} */

/*! @name MAC_PRESN_TIME_UPDT - MAC Presentation Time Update */
/*! @{ */

#define EMAC_MAC_PRESN_TIME_UPDT_MPTU_MASK       (0xFFFFFFFFU)
#define EMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT      (0U)
#define EMAC_MAC_PRESN_TIME_UPDT_MPTU_WIDTH      (32U)
#define EMAC_MAC_PRESN_TIME_UPDT_MPTU(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_PRESN_TIME_UPDT_MPTU_SHIFT)) & EMAC_MAC_PRESN_TIME_UPDT_MPTU_MASK)
/*! @} */

/*! @name MAC_ADDRESS0_HIGH - MAC Address 0 High */
/*! @{ */

#define EMAC_MAC_ADDRESS0_HIGH_ADDRHI_MASK       (0xFFFFU)
#define EMAC_MAC_ADDRESS0_HIGH_ADDRHI_SHIFT      (0U)
#define EMAC_MAC_ADDRESS0_HIGH_ADDRHI_WIDTH      (16U)
#define EMAC_MAC_ADDRESS0_HIGH_ADDRHI(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS0_HIGH_ADDRHI_SHIFT)) & EMAC_MAC_ADDRESS0_HIGH_ADDRHI_MASK)

#define EMAC_MAC_ADDRESS0_HIGH_DCS_MASK          (0x30000U)
#define EMAC_MAC_ADDRESS0_HIGH_DCS_SHIFT         (16U)
#define EMAC_MAC_ADDRESS0_HIGH_DCS_WIDTH         (2U)
#define EMAC_MAC_ADDRESS0_HIGH_DCS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS0_HIGH_DCS_SHIFT)) & EMAC_MAC_ADDRESS0_HIGH_DCS_MASK)

#define EMAC_MAC_ADDRESS0_HIGH_AE_MASK           (0x80000000U)
#define EMAC_MAC_ADDRESS0_HIGH_AE_SHIFT          (31U)
#define EMAC_MAC_ADDRESS0_HIGH_AE_WIDTH          (1U)
#define EMAC_MAC_ADDRESS0_HIGH_AE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS0_HIGH_AE_SHIFT)) & EMAC_MAC_ADDRESS0_HIGH_AE_MASK)
/*! @} */

/*! @name MAC_ADDRESS0_LOW - MAC Address 0 Low */
/*! @{ */

#define EMAC_MAC_ADDRESS0_LOW_ADDRLO_MASK        (0xFFFFFFFFU)
#define EMAC_MAC_ADDRESS0_LOW_ADDRLO_SHIFT       (0U)
#define EMAC_MAC_ADDRESS0_LOW_ADDRLO_WIDTH       (32U)
#define EMAC_MAC_ADDRESS0_LOW_ADDRLO(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS0_LOW_ADDRLO_SHIFT)) & EMAC_MAC_ADDRESS0_LOW_ADDRLO_MASK)
/*! @} */

/*! @name MAC_ADDRESS1_HIGH - MAC Address 1 High */
/*! @{ */

#define EMAC_MAC_ADDRESS1_HIGH_ADDRHI_MASK       (0xFFFFU)
#define EMAC_MAC_ADDRESS1_HIGH_ADDRHI_SHIFT      (0U)
#define EMAC_MAC_ADDRESS1_HIGH_ADDRHI_WIDTH      (16U)
#define EMAC_MAC_ADDRESS1_HIGH_ADDRHI(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS1_HIGH_ADDRHI_SHIFT)) & EMAC_MAC_ADDRESS1_HIGH_ADDRHI_MASK)

#define EMAC_MAC_ADDRESS1_HIGH_DCS_MASK          (0x30000U)
#define EMAC_MAC_ADDRESS1_HIGH_DCS_SHIFT         (16U)
#define EMAC_MAC_ADDRESS1_HIGH_DCS_WIDTH         (2U)
#define EMAC_MAC_ADDRESS1_HIGH_DCS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS1_HIGH_DCS_SHIFT)) & EMAC_MAC_ADDRESS1_HIGH_DCS_MASK)

#define EMAC_MAC_ADDRESS1_HIGH_MBC_MASK          (0x3F000000U)
#define EMAC_MAC_ADDRESS1_HIGH_MBC_SHIFT         (24U)
#define EMAC_MAC_ADDRESS1_HIGH_MBC_WIDTH         (6U)
#define EMAC_MAC_ADDRESS1_HIGH_MBC(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS1_HIGH_MBC_SHIFT)) & EMAC_MAC_ADDRESS1_HIGH_MBC_MASK)

#define EMAC_MAC_ADDRESS1_HIGH_SA_MASK           (0x40000000U)
#define EMAC_MAC_ADDRESS1_HIGH_SA_SHIFT          (30U)
#define EMAC_MAC_ADDRESS1_HIGH_SA_WIDTH          (1U)
#define EMAC_MAC_ADDRESS1_HIGH_SA(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS1_HIGH_SA_SHIFT)) & EMAC_MAC_ADDRESS1_HIGH_SA_MASK)

#define EMAC_MAC_ADDRESS1_HIGH_AE_MASK           (0x80000000U)
#define EMAC_MAC_ADDRESS1_HIGH_AE_SHIFT          (31U)
#define EMAC_MAC_ADDRESS1_HIGH_AE_WIDTH          (1U)
#define EMAC_MAC_ADDRESS1_HIGH_AE(x)             (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS1_HIGH_AE_SHIFT)) & EMAC_MAC_ADDRESS1_HIGH_AE_MASK)
/*! @} */

/*! @name MAC_ADDRESS1_LOW - MAC Address 1 Low */
/*! @{ */

#define EMAC_MAC_ADDRESS1_LOW_ADDRLO_MASK        (0xFFFFFFFFU)
#define EMAC_MAC_ADDRESS1_LOW_ADDRLO_SHIFT       (0U)
#define EMAC_MAC_ADDRESS1_LOW_ADDRLO_WIDTH       (32U)
#define EMAC_MAC_ADDRESS1_LOW_ADDRLO(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS1_LOW_ADDRLO_SHIFT)) & EMAC_MAC_ADDRESS1_LOW_ADDRLO_MASK)
/*! @} */

/*! @name MAC_ADDRESS2_HIGH - MAC Address 2 High */
/*! @{ */

#define EMAC_MAC_ADDRESS2_HIGH_ADDRHI_MASK       (0xFFFFU)
#define EMAC_MAC_ADDRESS2_HIGH_ADDRHI_SHIFT      (0U)
#define EMAC_MAC_ADDRESS2_HIGH_ADDRHI_WIDTH      (16U)
#define EMAC_MAC_ADDRESS2_HIGH_ADDRHI(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MAC_ADDRESS2_HIGH_ADDRHI_SHIFT)) & EMAC_MAC_ADDRESS2_HIGH_ADDRHI_MASK)

