zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_EMAC.h
#define EMAC_MTL_TXQ0_OPERATION_MODE_FTQ_MASK    (0x1U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_FTQ_SHIFT   (0U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_FTQ_WIDTH   (1U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_FTQ(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_OPERATION_MODE_FTQ_SHIFT)) & EMAC_MTL_TXQ0_OPERATION_MODE_FTQ_MASK)

#define EMAC_MTL_TXQ0_OPERATION_MODE_TSF_MASK    (0x2U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TSF_SHIFT   (1U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TSF_WIDTH   (1U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TSF(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_OPERATION_MODE_TSF_SHIFT)) & EMAC_MTL_TXQ0_OPERATION_MODE_TSF_MASK)

#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_MASK  (0xCU)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_SHIFT (2U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_WIDTH (2U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_SHIFT)) & EMAC_MTL_TXQ0_OPERATION_MODE_TXQEN_MASK)

#define EMAC_MTL_TXQ0_OPERATION_MODE_TTC_MASK    (0x70U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TTC_SHIFT   (4U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TTC_WIDTH   (3U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TTC(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_OPERATION_MODE_TTC_SHIFT)) & EMAC_MTL_TXQ0_OPERATION_MODE_TTC_MASK)

#define EMAC_MTL_TXQ0_OPERATION_MODE_TQS_MASK    (0x1F0000U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TQS_SHIFT   (16U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TQS_WIDTH   (5U)
#define EMAC_MTL_TXQ0_OPERATION_MODE_TQS(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_OPERATION_MODE_TQS_SHIFT)) & EMAC_MTL_TXQ0_OPERATION_MODE_TQS_MASK)
/*! @} */

/*! @name MTL_TXQ0_UNDERFLOW - MTL Tx Queue 0 Underflow */
/*! @{ */

#define EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_MASK    (0x7FFU)
#define EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_SHIFT   (0U)
#define EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_WIDTH   (11U)
#define EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_SHIFT)) & EMAC_MTL_TXQ0_UNDERFLOW_UFFRMCNT_MASK)

#define EMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_MASK    (0x800U)
#define EMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_SHIFT   (11U)
#define EMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_WIDTH   (1U)
#define EMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_SHIFT)) & EMAC_MTL_TXQ0_UNDERFLOW_UFCNTOVF_MASK)
/*! @} */

/*! @name MTL_TXQ0_DEBUG - MTL Tx Queue 0 Debug */
/*! @{ */

#define EMAC_MTL_TXQ0_DEBUG_TXQPAUSED_MASK       (0x1U)
#define EMAC_MTL_TXQ0_DEBUG_TXQPAUSED_SHIFT      (0U)
#define EMAC_MTL_TXQ0_DEBUG_TXQPAUSED_WIDTH      (1U)
#define EMAC_MTL_TXQ0_DEBUG_TXQPAUSED(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_DEBUG_TXQPAUSED_SHIFT)) & EMAC_MTL_TXQ0_DEBUG_TXQPAUSED_MASK)

#define EMAC_MTL_TXQ0_DEBUG_TRCSTS_MASK          (0x6U)
#define EMAC_MTL_TXQ0_DEBUG_TRCSTS_SHIFT         (1U)
#define EMAC_MTL_TXQ0_DEBUG_TRCSTS_WIDTH         (2U)
#define EMAC_MTL_TXQ0_DEBUG_TRCSTS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_DEBUG_TRCSTS_SHIFT)) & EMAC_MTL_TXQ0_DEBUG_TRCSTS_MASK)

#define EMAC_MTL_TXQ0_DEBUG_TWCSTS_MASK          (0x8U)
#define EMAC_MTL_TXQ0_DEBUG_TWCSTS_SHIFT         (3U)
#define EMAC_MTL_TXQ0_DEBUG_TWCSTS_WIDTH         (1U)
#define EMAC_MTL_TXQ0_DEBUG_TWCSTS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_DEBUG_TWCSTS_SHIFT)) & EMAC_MTL_TXQ0_DEBUG_TWCSTS_MASK)

#define EMAC_MTL_TXQ0_DEBUG_TXQSTS_MASK          (0x10U)
#define EMAC_MTL_TXQ0_DEBUG_TXQSTS_SHIFT         (4U)
#define EMAC_MTL_TXQ0_DEBUG_TXQSTS_WIDTH         (1U)
#define EMAC_MTL_TXQ0_DEBUG_TXQSTS(x)            (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_DEBUG_TXQSTS_SHIFT)) & EMAC_MTL_TXQ0_DEBUG_TXQSTS_MASK)

#define EMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_MASK       (0x20U)
#define EMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_SHIFT      (5U)
#define EMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_WIDTH      (1U)
#define EMAC_MTL_TXQ0_DEBUG_TXSTSFSTS(x)         (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_SHIFT)) & EMAC_MTL_TXQ0_DEBUG_TXSTSFSTS_MASK)

#define EMAC_MTL_TXQ0_DEBUG_PTXQ_MASK            (0x70000U)
#define EMAC_MTL_TXQ0_DEBUG_PTXQ_SHIFT           (16U)
#define EMAC_MTL_TXQ0_DEBUG_PTXQ_WIDTH           (3U)
#define EMAC_MTL_TXQ0_DEBUG_PTXQ(x)              (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_DEBUG_PTXQ_SHIFT)) & EMAC_MTL_TXQ0_DEBUG_PTXQ_MASK)

#define EMAC_MTL_TXQ0_DEBUG_STXSTSF_MASK         (0x700000U)
#define EMAC_MTL_TXQ0_DEBUG_STXSTSF_SHIFT        (20U)
#define EMAC_MTL_TXQ0_DEBUG_STXSTSF_WIDTH        (3U)
#define EMAC_MTL_TXQ0_DEBUG_STXSTSF(x)           (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_DEBUG_STXSTSF_SHIFT)) & EMAC_MTL_TXQ0_DEBUG_STXSTSF_MASK)
/*! @} */

/*! @name MTL_TXQ0_ETS_STATUS - MTL Tx Queue 0 ETS Status */
/*! @{ */

#define EMAC_MTL_TXQ0_ETS_STATUS_ABS_MASK        (0xFFFFFFU)
#define EMAC_MTL_TXQ0_ETS_STATUS_ABS_SHIFT       (0U)
#define EMAC_MTL_TXQ0_ETS_STATUS_ABS_WIDTH       (24U)
#define EMAC_MTL_TXQ0_ETS_STATUS_ABS(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_ETS_STATUS_ABS_SHIFT)) & EMAC_MTL_TXQ0_ETS_STATUS_ABS_MASK)
/*! @} */

/*! @name MTL_TXQ0_QUANTUM_WEIGHT - MTL Tx Queue Quantum Weight */
/*! @{ */

#define EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_MASK  (0x1FFFFFU)
#define EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_SHIFT (0U)
#define EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_WIDTH (21U)
#define EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW(x)    (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_SHIFT)) & EMAC_MTL_TXQ0_QUANTUM_WEIGHT_ISCQW_MASK)
/*! @} */

/*! @name MTL_Q0_INTERRUPT_CONTROL_STATUS - MTL Queue 0 Interrupt Control Status */
/*! @{ */

#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_MASK (0x1U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_SHIFT (0U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_WIDTH (1U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_SHIFT)) & EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUNFIS_MASK)

#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_MASK (0x2U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_SHIFT (1U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_WIDTH (1U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_SHIFT)) & EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_ABPSIS_MASK)

#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_MASK (0x100U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_SHIFT (8U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_WIDTH (1U)
#define EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE(x) (((uint32_t)(((uint32_t)(x)) << EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_SHIFT)) & EMAC_MTL_Q0_INTERRUPT_CONTROL_STATUS_TXUIE_MASK)

