zephyrproject-rtos/hal_nxp/s32/drivers/s32k3/BaseNXP/header/S32K314_EMAC.h
/*! @name DMA_CH1_STATUS - DMA Channel 1 Status */
/*! @{ */

#define EMAC_DMA_CH1_STATUS_TI_MASK              (0x1U)
#define EMAC_DMA_CH1_STATUS_TI_SHIFT             (0U)
#define EMAC_DMA_CH1_STATUS_TI_WIDTH             (1U)
#define EMAC_DMA_CH1_STATUS_TI(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_TI_SHIFT)) & EMAC_DMA_CH1_STATUS_TI_MASK)

#define EMAC_DMA_CH1_STATUS_TPS_MASK             (0x2U)
#define EMAC_DMA_CH1_STATUS_TPS_SHIFT            (1U)
#define EMAC_DMA_CH1_STATUS_TPS_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_TPS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_TPS_SHIFT)) & EMAC_DMA_CH1_STATUS_TPS_MASK)

#define EMAC_DMA_CH1_STATUS_TBU_MASK             (0x4U)
#define EMAC_DMA_CH1_STATUS_TBU_SHIFT            (2U)
#define EMAC_DMA_CH1_STATUS_TBU_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_TBU(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_TBU_SHIFT)) & EMAC_DMA_CH1_STATUS_TBU_MASK)

#define EMAC_DMA_CH1_STATUS_RI_MASK              (0x40U)
#define EMAC_DMA_CH1_STATUS_RI_SHIFT             (6U)
#define EMAC_DMA_CH1_STATUS_RI_WIDTH             (1U)
#define EMAC_DMA_CH1_STATUS_RI(x)                (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_RI_SHIFT)) & EMAC_DMA_CH1_STATUS_RI_MASK)

#define EMAC_DMA_CH1_STATUS_RBU_MASK             (0x80U)
#define EMAC_DMA_CH1_STATUS_RBU_SHIFT            (7U)
#define EMAC_DMA_CH1_STATUS_RBU_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_RBU(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_RBU_SHIFT)) & EMAC_DMA_CH1_STATUS_RBU_MASK)

#define EMAC_DMA_CH1_STATUS_RPS_MASK             (0x100U)
#define EMAC_DMA_CH1_STATUS_RPS_SHIFT            (8U)
#define EMAC_DMA_CH1_STATUS_RPS_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_RPS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_RPS_SHIFT)) & EMAC_DMA_CH1_STATUS_RPS_MASK)

#define EMAC_DMA_CH1_STATUS_RWT_MASK             (0x200U)
#define EMAC_DMA_CH1_STATUS_RWT_SHIFT            (9U)
#define EMAC_DMA_CH1_STATUS_RWT_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_RWT(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_RWT_SHIFT)) & EMAC_DMA_CH1_STATUS_RWT_MASK)

#define EMAC_DMA_CH1_STATUS_ETI_MASK             (0x400U)
#define EMAC_DMA_CH1_STATUS_ETI_SHIFT            (10U)
#define EMAC_DMA_CH1_STATUS_ETI_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_ETI(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_ETI_SHIFT)) & EMAC_DMA_CH1_STATUS_ETI_MASK)

#define EMAC_DMA_CH1_STATUS_ERI_MASK             (0x800U)
#define EMAC_DMA_CH1_STATUS_ERI_SHIFT            (11U)
#define EMAC_DMA_CH1_STATUS_ERI_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_ERI(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_ERI_SHIFT)) & EMAC_DMA_CH1_STATUS_ERI_MASK)

#define EMAC_DMA_CH1_STATUS_FBE_MASK             (0x1000U)
#define EMAC_DMA_CH1_STATUS_FBE_SHIFT            (12U)
#define EMAC_DMA_CH1_STATUS_FBE_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_FBE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_FBE_SHIFT)) & EMAC_DMA_CH1_STATUS_FBE_MASK)

#define EMAC_DMA_CH1_STATUS_CDE_MASK             (0x2000U)
#define EMAC_DMA_CH1_STATUS_CDE_SHIFT            (13U)
#define EMAC_DMA_CH1_STATUS_CDE_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_CDE(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_CDE_SHIFT)) & EMAC_DMA_CH1_STATUS_CDE_MASK)

#define EMAC_DMA_CH1_STATUS_AIS_MASK             (0x4000U)
#define EMAC_DMA_CH1_STATUS_AIS_SHIFT            (14U)
#define EMAC_DMA_CH1_STATUS_AIS_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_AIS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_AIS_SHIFT)) & EMAC_DMA_CH1_STATUS_AIS_MASK)

#define EMAC_DMA_CH1_STATUS_NIS_MASK             (0x8000U)
#define EMAC_DMA_CH1_STATUS_NIS_SHIFT            (15U)
#define EMAC_DMA_CH1_STATUS_NIS_WIDTH            (1U)
#define EMAC_DMA_CH1_STATUS_NIS(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_NIS_SHIFT)) & EMAC_DMA_CH1_STATUS_NIS_MASK)

#define EMAC_DMA_CH1_STATUS_TEB_MASK             (0x70000U)
#define EMAC_DMA_CH1_STATUS_TEB_SHIFT            (16U)
#define EMAC_DMA_CH1_STATUS_TEB_WIDTH            (3U)
#define EMAC_DMA_CH1_STATUS_TEB(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_TEB_SHIFT)) & EMAC_DMA_CH1_STATUS_TEB_MASK)

#define EMAC_DMA_CH1_STATUS_REB_MASK             (0x380000U)
#define EMAC_DMA_CH1_STATUS_REB_SHIFT            (19U)
#define EMAC_DMA_CH1_STATUS_REB_WIDTH            (3U)
#define EMAC_DMA_CH1_STATUS_REB(x)               (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_STATUS_REB_SHIFT)) & EMAC_DMA_CH1_STATUS_REB_MASK)
/*! @} */

/*! @name DMA_CH1_MISS_FRAME_CNT - DMA Channel 1 Miss Frame Counter */
/*! @{ */

#define EMAC_DMA_CH1_MISS_FRAME_CNT_MFC_MASK     (0x7FFU)
#define EMAC_DMA_CH1_MISS_FRAME_CNT_MFC_SHIFT    (0U)
#define EMAC_DMA_CH1_MISS_FRAME_CNT_MFC_WIDTH    (11U)
#define EMAC_DMA_CH1_MISS_FRAME_CNT_MFC(x)       (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_MISS_FRAME_CNT_MFC_SHIFT)) & EMAC_DMA_CH1_MISS_FRAME_CNT_MFC_MASK)

#define EMAC_DMA_CH1_MISS_FRAME_CNT_MFCO_MASK    (0x8000U)
#define EMAC_DMA_CH1_MISS_FRAME_CNT_MFCO_SHIFT   (15U)
#define EMAC_DMA_CH1_MISS_FRAME_CNT_MFCO_WIDTH   (1U)
#define EMAC_DMA_CH1_MISS_FRAME_CNT_MFCO(x)      (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_MISS_FRAME_CNT_MFCO_SHIFT)) & EMAC_DMA_CH1_MISS_FRAME_CNT_MFCO_MASK)
/*! @} */

/*! @name DMA_CH1_RXP_ACCEPT_CNT - DMA Channel 1 Rx Parser Accept Count */
/*! @{ */

#define EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPAC_MASK   (0x7FFFFFFFU)
#define EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPAC_SHIFT  (0U)
#define EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPAC_WIDTH  (31U)
#define EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPAC(x)     (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPAC_SHIFT)) & EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPAC_MASK)

#define EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPACOF_MASK (0x80000000U)
#define EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPACOF_SHIFT (31U)
#define EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPACOF_WIDTH (1U)
#define EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPACOF(x)   (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPACOF_SHIFT)) & EMAC_DMA_CH1_RXP_ACCEPT_CNT_RXPACOF_MASK)
/*! @} */

/*! @name DMA_CH1_RX_ERI_CNT - DMA Channel 1 Rx ERI Count */
/*! @{ */

#define EMAC_DMA_CH1_RX_ERI_CNT_ECNT_MASK        (0xFFFU)
#define EMAC_DMA_CH1_RX_ERI_CNT_ECNT_SHIFT       (0U)
#define EMAC_DMA_CH1_RX_ERI_CNT_ECNT_WIDTH       (12U)
#define EMAC_DMA_CH1_RX_ERI_CNT_ECNT(x)          (((uint32_t)(((uint32_t)(x)) << EMAC_DMA_CH1_RX_ERI_CNT_ECNT_SHIFT)) & EMAC_DMA_CH1_RX_ERI_CNT_ECNT_MASK)
/*! @} */

/*!
 * @}
 */ /* end of group EMAC_Register_Masks */

/*!
 * @}
 */ /* end of group EMAC_Peripheral_Access_Layer */

#endif  /* #if !defined(S32K314_EMAC_H_) */
